lib/EWS_Calls/resolveNames.xml

<?xml version="1.0" encoding="utf-8"?> <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header>
	<t:RequestServerVersion Version="REPLACE_EXCHANGE_VERSION" />
</soap:Header>
<soap:Body>
	<ResolveNames xmlns="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" SearchScope="ActiveDirectory" ReturnFullContactData="true">
		<UnresolvedEntry>REPLACE_QUERY_STRING</UnresolvedEntry>
	</ResolveNames>
</soap:Body>
</soap:Envelope>